Revit 2026 API

# Zone Properties

---

The Zone type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Area | Get the Area of the Zone. |
|  | AssemblyInstanceId | The id of the assembly instance to which the element belongs. (Inherited from Element) |
|  | Boundary | Returns the boundary of the Zone. |
|  | BoundingBox | Retrieves a box that circumscribes all geometry of the element.(Inherited from Element) |
|  | CalculatedCoolingLoad | **Obsolete.** Get the Calculated Cooling Load of the Zone. |
|  | CalculatedHeatingLoad | **Obsolete.** Get the Calculated Heating Load of the Zone. |
|  | CalculatedSupplyAirflow | **Obsolete.** Get the Calculated Supply Airflow of the Zone. |
|  | Category | Retrieves a Category object that represents the category or sub category in which the element resides.(Inherited from Element) |
|  | CoolingAirTemperature | **Obsolete.** Get or set the Cooling Air Temperature of the Zone. |
|  | CoolingSetPoint | **Obsolete.** Get or set the Cooling Set Point of the Zone. |
|  | CreatedPhaseId | Id of a Phase at which the Element was created. (Inherited from Element) |
|  | DehumidificationSetPoint | **Obsolete.** Get or set the DeHumidification Set Point of the Zone. |
|  | DemolishedPhaseId | Id of a Phase at which the Element was demolished. (Inherited from Element) |
|  | DesignOption | Returns the design option to which the element belongs.(Inherited from Element) |
|  | Document | Returns the Document in which the Element resides.(Inherited from Element) |
|  | Geometry | Retrieves the geometric representation of the element.(Inherited from Element) |
|  | GrossArea | **Obsolete.** Get the Gross Area of the Zone. |
|  | GrossVolume | **Obsolete.** Get the Gross Volume of the Zone. |
|  | GroupId | The id of the group to which an element belongs. (Inherited from Element) |
|  | HeatingAirTemperature | **Obsolete.** Get or set the Heating Air Temperature of the Zone. |
|  | HeatingSetPoint | **Obsolete.** Get or set the Heating Set Point of the Zone. |
|  | HumidificationSetPoint | **Obsolete.** Get or set the Humidification Set Point of the Zone. |
|  | Id | A unique identifier for an Element in an Autodesk Revit project. (Inherited from Element) |
|  | IsDefaultZone | **Obsolete.** Reports whether this zone is default or not. |
|  | IsModifiable | Identifies if the element is modifiable. (Inherited from Element) |
|  | IsTransient | Indicates whether an element is transient or permanent. (Inherited from Element) |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from Element) |
|  | LevelId | The id of the level associated with the element. (Inherited from Element) |
|  | Location | This property is used to find the physical location of an element within a project.(Inherited from Element) |
|  | Name | Get or Set the Name of the Zone.(Overrides ElementName) |
|  | OwnerViewId | The id of the view that owns the element. (Inherited from Element) |
|  | ParameterBuiltInParameter | Retrieves a parameter from the element given a parameter id.(Inherited from Element) |
|  | ParameterDefinition | Retrieves a parameter from the element based on its definition.(Inherited from Element) |
|  | ParameterGuid | Retrieves a parameter from the element given a GUID for a shared parameter.(Inherited from Element) |
|  | Parameters | Retrieves a set containing all of the parameters that are contained within the element.(Inherited from Element) |
|  | ParametersMap | Retrieves a map containing all of the parameters that are contained within the element.(Inherited from Element) |
|  | Perimeter | **Obsolete.** Get the Perimeter of the Zone. |
|  | Phase | Get the Phase of the Zone. |
|  | Pinned | Identifies if the element has been pinned to prevent changes. (Inherited from Element) |
|  | ServiceType | **Obsolete.** Get or set the Service Type of the Zone. |
|  | Spaces | Get the Spaces of the Zone. |
|  | UniqueId | A stable unique identifier for an element within the document. (Inherited from Element) |
|  | VersionGuid | Get the element version Guid. (Inherited from Element) |
|  | ViewSpecific | Identifies if the element is owned by a view. (Inherited from Element) |
|  | Volume | **Obsolete.** Get the Volume of the Zone. |
|  | WorksetId | Get Id of the Workset which owns the element. (Inherited from Element) |

#### Reference

Zone Class

Autodesk.Revit.DB.Mechanical Namespace